{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.14.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "basenet.slice1.0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice1.0", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice1.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice1.1", "inbound_nodes": [[["basenet.slice1.0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice1.2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice1.2", "inbound_nodes": [[["basenet.slice1.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice1.3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice1.3", "inbound_nodes": [[["basenet.slice1.2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice1.4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice1.4", "inbound_nodes": [[["basenet.slice1.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice1.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice1.5", "inbound_nodes": [[["basenet.slice1.4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "basenet.slice1.6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "basenet.slice1.6", "inbound_nodes": [[["basenet.slice1.5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice1.7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice1.7", "inbound_nodes": [[["basenet.slice1.6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice1.8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice1.8", "inbound_nodes": [[["basenet.slice1.7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice1.9", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice1.9", "inbound_nodes": [[["basenet.slice1.8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice1.10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice1.10", "inbound_nodes": [[["basenet.slice1.9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice1.11", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice1.11", "inbound_nodes": [[["basenet.slice1.10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice1.12", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice1.12", "inbound_nodes": [[["basenet.slice1.11", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "basenet.slice1.13", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "basenet.slice1.13", "inbound_nodes": [[["basenet.slice1.12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice2.14", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice2.14", "inbound_nodes": [[["basenet.slice1.13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice2.15", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice2.15", "inbound_nodes": [[["basenet.slice2.14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice2.16", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice2.16", "inbound_nodes": [[["basenet.slice2.15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice2.17", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice2.17", "inbound_nodes": [[["basenet.slice2.16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice2.18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice2.18", "inbound_nodes": [[["basenet.slice2.17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice2.19", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice2.19", "inbound_nodes": [[["basenet.slice2.18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice3.20", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice3.20", "inbound_nodes": [[["basenet.slice2.19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice3.21", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice3.21", "inbound_nodes": [[["basenet.slice3.20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice3.22", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice3.22", "inbound_nodes": [[["basenet.slice3.21", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "basenet.slice3.23", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "basenet.slice3.23", "inbound_nodes": [[["basenet.slice3.22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice3.24", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice3.24", "inbound_nodes": [[["basenet.slice3.23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice3.25", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice3.25", "inbound_nodes": [[["basenet.slice3.24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice3.26", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice3.26", "inbound_nodes": [[["basenet.slice3.25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice3.27", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice3.27", "inbound_nodes": [[["basenet.slice3.26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice3.28", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice3.28", "inbound_nodes": [[["basenet.slice3.27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice3.29", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice3.29", "inbound_nodes": [[["basenet.slice3.28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice4.30", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice4.30", "inbound_nodes": [[["basenet.slice3.29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice4.31", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice4.31", "inbound_nodes": [[["basenet.slice4.30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice4.32", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice4.32", "inbound_nodes": [[["basenet.slice4.31", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "basenet.slice4.33", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "basenet.slice4.33", "inbound_nodes": [[["basenet.slice4.32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice4.34", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice4.34", "inbound_nodes": [[["basenet.slice4.33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice4.35", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice4.35", "inbound_nodes": [[["basenet.slice4.34", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "basenet.slice4.36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "basenet.slice4.36", "inbound_nodes": [[["basenet.slice4.35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice4.37", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice4.37", "inbound_nodes": [[["basenet.slice4.36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.slice4.38", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.slice4.38", "inbound_nodes": [[["basenet.slice4.37", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "basenet.slice5.0", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "basenet.slice5.0", "inbound_nodes": [[["basenet.slice4.38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice5.1", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [6, 6], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice5.1", "inbound_nodes": [[["basenet.slice5.0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.slice5.2", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.slice5.2", "inbound_nodes": [[["basenet.slice5.1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["basenet.slice5.2", 0, 0, {}], ["basenet.slice4.38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv1.conv.0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv1.conv.0", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv1.conv.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv1.conv.1", "inbound_nodes": [[["upconv1.conv.0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv1.conv.2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv1.conv.2", "inbound_nodes": [[["upconv1.conv.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv1.conv.3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv1.conv.3", "inbound_nodes": [[["upconv1.conv.2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv1.conv.4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv1.conv.4", "inbound_nodes": [[["upconv1.conv.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv1.conv.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv1.conv.5", "inbound_nodes": [[["upconv1.conv.4", 0, 0, {}]]]}, {"class_name": "UpsampleLike", "config": {"name": "upsample_like", "trainable": true, "dtype": "float32"}, "name": "upsample_like", "inbound_nodes": [[["upconv1.conv.5", 0, 0, {}], ["basenet.slice3.29", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["upsample_like", 0, 0, {}], ["basenet.slice3.29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv2.conv.0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv2.conv.0", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv2.conv.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv2.conv.1", "inbound_nodes": [[["upconv2.conv.0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv2.conv.2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv2.conv.2", "inbound_nodes": [[["upconv2.conv.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv2.conv.3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv2.conv.3", "inbound_nodes": [[["upconv2.conv.2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv2.conv.4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv2.conv.4", "inbound_nodes": [[["upconv2.conv.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv2.conv.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv2.conv.5", "inbound_nodes": [[["upconv2.conv.4", 0, 0, {}]]]}, {"class_name": "UpsampleLike", "config": {"name": "upsample_like_1", "trainable": true, "dtype": "float32"}, "name": "upsample_like_1", "inbound_nodes": [[["upconv2.conv.5", 0, 0, {}], ["basenet.slice2.19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["upsample_like_1", 0, 0, {}], ["basenet.slice2.19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv3.conv.0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv3.conv.0", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv3.conv.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv3.conv.1", "inbound_nodes": [[["upconv3.conv.0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv3.conv.2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv3.conv.2", "inbound_nodes": [[["upconv3.conv.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv3.conv.3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv3.conv.3", "inbound_nodes": [[["upconv3.conv.2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv3.conv.4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv3.conv.4", "inbound_nodes": [[["upconv3.conv.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv3.conv.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv3.conv.5", "inbound_nodes": [[["upconv3.conv.4", 0, 0, {}]]]}, {"class_name": "UpsampleLike", "config": {"name": "upsample_like_2", "trainable": true, "dtype": "float32"}, "name": "upsample_like_2", "inbound_nodes": [[["upconv3.conv.5", 0, 0, {}], ["basenet.slice1.12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["upsample_like_2", 0, 0, {}], ["basenet.slice1.12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv4.conv.0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv4.conv.0", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv4.conv.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv4.conv.1", "inbound_nodes": [[["upconv4.conv.0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv4.conv.2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv4.conv.2", "inbound_nodes": [[["upconv4.conv.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upconv4.conv.3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upconv4.conv.3", "inbound_nodes": [[["upconv4.conv.2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "upconv4.conv.4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "upconv4.conv.4", "inbound_nodes": [[["upconv4.conv.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "upconv4.conv.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "upconv4.conv.5", "inbound_nodes": [[["upconv4.conv.4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_cls.0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_cls.0", "inbound_nodes": [[["upconv4.conv.5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv_cls.1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv_cls.1", "inbound_nodes": [[["conv_cls.0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_cls.2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_cls.2", "inbound_nodes": [[["conv_cls.1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv_cls.3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv_cls.3", "inbound_nodes": [[["conv_cls.2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_cls.4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_cls.4", "inbound_nodes": [[["conv_cls.3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv_cls.5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv_cls.5", "inbound_nodes": [[["conv_cls.4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_cls.6", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_cls.6", "inbound_nodes": [[["conv_cls.5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv_cls.7", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv_cls.7", "inbound_nodes": [[["conv_cls.6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_cls.8", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_cls.8", "inbound_nodes": [[["conv_cls.7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv_cls.8", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of20.bin", "group1-shard2of20.bin", "group1-shard3of20.bin", "group1-shard4of20.bin", "group1-shard5of20.bin", "group1-shard6of20.bin", "group1-shard7of20.bin", "group1-shard8of20.bin", "group1-shard9of20.bin", "group1-shard10of20.bin", "group1-shard11of20.bin", "group1-shard12of20.bin", "group1-shard13of20.bin", "group1-shard14of20.bin", "group1-shard15of20.bin", "group1-shard16of20.bin", "group1-shard17of20.bin", "group1-shard18of20.bin", "group1-shard19of20.bin", "group1-shard20of20.bin"], "weights": [{"name": "basenet.slice1.0/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "basenet.slice1.0/bias", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/gamma", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/beta", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.10/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "basenet.slice1.10/bias", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/gamma", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/beta", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "basenet.slice1.3/bias", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/gamma", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/beta", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.7/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "basenet.slice1.7/bias", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/gamma", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/beta", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice2.14/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "basenet.slice2.14/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.17/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "basenet.slice2.17/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.20/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "basenet.slice3.20/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.24/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "basenet.slice3.24/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.27/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice3.27/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.30/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.30/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.34/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.34/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.37/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.37/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice5.1/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "basenet.slice5.1/bias", "shape": [1024], "dtype": "float32"}, {"name": "basenet.slice5.2/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "basenet.slice5.2/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv_cls.0/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_cls.0/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_cls.2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_cls.2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_cls.4/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv_cls.4/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_cls.6/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "conv_cls.6/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_cls.8/kernel", "shape": [1, 1, 16, 2], "dtype": "float32"}, {"name": "conv_cls.8/bias", "shape": [2], "dtype": "float32"}, {"name": "upconv1.conv.0/kernel", "shape": [1, 1, 1536, 512], "dtype": "float32"}, {"name": "upconv1.conv.0/bias", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/gamma", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/beta", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.3/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "upconv1.conv.3/bias", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/gamma", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/beta", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.0/kernel", "shape": [1, 1, 768, 256], "dtype": "float32"}, {"name": "upconv2.conv.0/bias", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/gamma", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/beta", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.3/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "upconv2.conv.3/bias", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/gamma", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/beta", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.0/kernel", "shape": [1, 1, 384, 128], "dtype": "float32"}, {"name": "upconv3.conv.0/bias", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/gamma", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/beta", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.3/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "upconv3.conv.3/bias", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/gamma", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/beta", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.0/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "upconv4.conv.0/bias", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/gamma", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/beta", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.3/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "upconv4.conv.3/bias", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/gamma", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/beta", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/moving_variance", "shape": [32], "dtype": "float32"}]}]}